<<<<<<< HEAD
//Создайте три переменные с любыми числовыми значениями. 
//Используя условный оператор  и не используя логические, найдите минимальное число и отобразите на экране имя переменной и ее значение.

let a = 5;
let b = 7;
let c = 3;

if ((a = b)) {
    if (b < c) {
      console.log("b=", b);
    } else {
      console.log("c=", c);
    }
  } else {
    if (a < c) {
      console.log("a=", a);
    } else {
      console.log("c=", c);
    }
=======
//Создайте три переменные с любыми числовыми значениями. 
//Используя условный оператор  и не используя логические, найдите минимальное число и отобразите на экране имя переменной и ее значение.

let a = 5;
let b = 7;
let c = 3;

if ((a = b)) {
    if (b < c) {
      console.log("b=", b);
    } else {
      console.log("c=", c);
    }
  } else {
    if (a < c) {
      console.log("a=", a);
    } else {
      console.log("c=", c);
    }
>>>>>>> origin/master
  }